app/Controllers/AsetNonAktifController.php

    public function delete($kode_aset_nonaktif)
    {
        $model = new AsetNonAktifModel();
        $model->delete($kode_aset_nonaktif);
---
DELETE FROM `aset_nonaktif`
WHERE `kode_aset_nonaktif` IN ('7')