app/Controllers/Home.php

    public function index(): string
    {
        $assetTotal = $this->kelola->countAllResults();
        $assetTerima = $this->asset->where('status', 'diterima')->countAllResults();
        $assetTolak = $this->asset->where('status', 'ditolak')->countAllResults();
        $assetPerbaikan = $this->perbaikan->where('status', 'belum selesai')->countAllResults();
        $chart = $this->kelola->table('kelola_aset');
        $chart->select('kategori.nama_kategori, SUM(kelola_aset.jumlah) as total_kelola_aset');
        $chart->join('kategori', 'kategori.id_kategori = kelola_aset.id_kategori', 'left');
        $chart->groupBy('kelola_aset.id_kategori');
        $chart = $chart->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `perbaikan`
WHERE `status` = 'belum selesai'
SELECT `kategori`.`nama_kategori`, SUM(kelola_aset.jumlah) as total_kelola_aset
FROM `kelola_aset`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `kelola_aset`.`id_kategori`
GROUP BY `kelola_aset`.`id_kategori`